#!/usr/bin/perl

use lib qw(../lib);

use Data::Dumper;
use Wiz::Test qw(no_plan);
use Wiz::Text::Mecab qw(:all);

sub main {
    my $str = 'コンビニへ行ってコーヒーを買い、窓から投げ捨てました。';
    is_deeply [ mecab_parse($str, [ MECAB_WORD, MECAB_READING ]) ], [
        [ 'コンビニ', 'コンビニ' ],
        [ 'へ', 'ヘ' ],
        [ '行っ', 'イッ' ],
        [ 'て', 'テ' ],
        [ 'コーヒー', 'コーヒー' ],
        [ 'を', 'ヲ' ],
        [ '買い', 'カイ' ],
        [ '、', '、' ],
        [ '窓', 'マド' ],
        [ 'から', 'カラ' ],
        [ '投げ捨て', 'ナゲステ' ],
        [ 'まし', 'マシ' ],
        [ 'た', 'タ' ],
        [ '。', '。' ]
    ];
    is_deeply [ mecab_parse($str, undef, WORD_CLASS_NOUN | WORD_CLASS_VERB) ], [
        [ 'コンビニ', '名詞', '一般', '*', '*', '*', '*', 'コンビニ', 'コンビニ', 'コンビニ' ],
        [ '行っ', '動詞', '自立', '*', '*', '五段・カ行促音便', '連用タ接続', '行く', 'イッ', 'イッ' ],
        [ 'コーヒー', '名詞', '一般', '*', '*', '*', '*', 'コーヒー', 'コーヒー', 'コーヒー' ],
        [ '買い', '動詞', '自立', '*', '*', '五段・ワ行促音便', '連用形', '買う', 'カイ', 'カイ' ], 
        [ '窓', '名詞', '一般', '*', '*', '*', '*', '窓', 'マド', 'マド' ],
        [ '投げ捨て', '動詞', '自立', '*', '*', '一段', '連用形', '投げ捨てる', 'ナゲステ', 'ナゲステ' ]
    ]; 
    is_deeply [ mecab_parse($str, [ MECAB_WORD, MECAB_READING ], WORD_CLASS_NOUN) ], [
        [ 'コンビニ', 'コンビニ' ],
        [ 'コーヒー', 'コーヒー' ],
        [ '窓', 'マド' ]
    ];
    is_deeply [ wakachi($str) ], [
        'コンビニ', 'へ', '行っ', 'て', 'コーヒー', 'を', '買い', '、', '窓', 'から',
        '投げ捨て', 'まし', 'た', '。'
    ]; 
    is_deeply [ wakachi($str, WORD_CLASS_NOUN) ], [ 'コンビニ', 'コーヒー', '窓' ];
    return 0;
}

exit main;
